//Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

Console.WriteLine("Введите любое число: ");
int num = Convert.ToInt32(Console.ReadLine());

if (num < 100)
{
    Console.WriteLine("В заданном числе нет третьей цифры, попробуйте еще раз");
}
else
{
    num = (num % 100) % 10;
    Console.WriteLine($"Третья цифра введённого числа: {num}");
}
